## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                 NAME                                 |
|----------|----------------------------------------------------------------------|
| add      | `aws_db_subnet_group.notification-canada-ca-reader-db`               |
|          | `aws_rds_cluster_instance.notification-canada-ca-separate-reader-db` |
| recreate | `aws_rds_cluster_parameter_group.default`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_subnet_group.notification-canada-ca-reader-db will be created
  + resource "aws_db_subnet_group" "notification-canada-ca-reader-db" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "notification-canada-ca-separate-reader-dbstaging"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0af8b8402f1d60523",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_rds_cluster_instance.notification-canada-ca-separate-reader-db will be created
  + resource "aws_rds_cluster_instance" "notification-canada-ca-separate-reader-db" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "notification-canada-ca-staging-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "notification-canada-ca-separate-reader-dbstaging"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "11.17"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "notification-canada-ca-staging-separate-reader-db-0"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.r6g.large"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "wed:04:00-wed:04:30"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + writer                                = (known after apply)
    }

  # aws_rds_cluster_parameter_group.default must be replaced
-/+ resource "aws_rds_cluster_parameter_group" "default" {
      ~ arn         = "arn:aws:rds:ca-central-1:239043911459:cluster-pg:rds-cluster-pg" -> (known after apply)
      ~ family      = "aurora-postgresql11" -> "aurora-postgresql15" # forces replacement
      ~ id          = "rds-cluster-pg" -> (known after apply)
        name        = "rds-cluster-pg"
      + name_prefix = (known after apply)
        tags        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (2 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca-reader-db"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-separate-reader-db"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

36 tests, 19 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
